# Кортежі - це важлива структура даних, подібна до списків, але з ключовою відмінністю: вони незмінні.
# Щоб створити порожній кортеж, існують два способи, хоча й не зовсім зрозуміло, навіщо потрібний порожній кортеж 😄:
my_tuple = tuple() # або
my_tuple = ()

# Створення ж непорожніх кортежів відбувається наступним чином:
my_tuple = (1, 2, 3)

# Якщо ви хочете створити кортеж з одним елементом, не забудьте поставити кому. 
# Це важливо, запам'ятай це! Інакше ви отримаєте змінну, яка просто зберігає елемент кортежу.
my_tuple = (1,)

# Кортеж, як і список, може містити різні типи даних:
my_tuple = (1, "Hello", 3.14)
first_item = my_tuple[0]  # Отримати перший елемент
print(f"first element value: {first_item}")

# Оскільки кортежі є незмінними, неможна додавати, видаляти або змінювати їх елементи після створення.
# Це робить їх ідеальними для використання в ситуаціях, де потрібно гарантувати, що дані залишаться без змін.

# Наприклад, розглянемо набір точок на площині (кортежі). Їх можна використовувати як ключі у словнику:
points = {
    (0, 0): "O",
    (1, 1): "A",
    (2, 2): "B"
}
#У словнику points використовуються кортежі з координатами точок як ключі, а значення — це імена (назва) точок.
print(points)

# 💡 Головна різниця між кортежами та списками полягає в їхній незмінності.
# Кортежі — це чудовий вибір, коли тобі потрібна впорядкована колекція, яка не повинна змінюватися.
# Списки ж ідеально підходять для випадків, коли тобі потрібна подібна до кортежу структура, але з можливістю модифікації.